Embedfire-emxgui/emXGUI_demo_stm32f429/99-FreeRTOS+emXGUI综合桌面_4.3寸/User/app/Board_App/clock/GUI_CLOCK_DIALOG.c
#include "emXGUI.h"
#include "./clock/GUI_CLOCK_DIALOG.h"
#include "x_libc.h"
#include "string.h"
#include "ff.h"
#include "GUI_AppDef.h"
#include "emXGUI_JPEG.h"
#include "emxgui_png.h"
#include "./clock/RTC/bsp_rtc.h"
#include "stm32f4xx_rtc.h"
#include <stdlib.h>
#include "./pic_load/gui_pic_load.h"

#define ICON_BTN_NUM     2     // 按钮数量
#define ICON_TEXT_NUM   (5 + ICON_BTN_NUM)    // 文本数量

struct
{
	uint8_t page;    // 当前设置页面
	uint8_t dial;    // 选中的表盘
}Set_Start;

uint8_t clock_dial = 0;    // 表盘
static HWND clock_hwnd;

const WCHAR Week_List[][4] = {{L"星期一"}, {L"星期二"}, {L"星期三"}, {L"星期四"}, {L"星期五"}, {L"星期六"}, {L"星期日"}};
const uint8_t month_list[12] = {31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31};    // 记录每月的最多天数

//图标管理数组
const clock_icon_t clock_icon[] = {

  /* 按钮 */
  {L"设置",           {190, 222, 100,  40},  ID_CLOCK_SET},             // 0. 设置
  {L"O",              {444,  0,  36,  36},  ID_CLOCK_EXIT},            // 1. 退出

  /* 文本 */
  {L"1",              {351, 118, 36,  37},  ID_CLOCK_DAY},             // 2. 日
  {L"星期一",         {344, 89,  50,  25},  ID_CLOCK_WEEK},            // 3. 周
  {L"1月",            {354, 159,  30,  25},  ID_CLOCK_MONTH},           // 4. 月
  {L" ",              {45,  67, 133, 139},  ID_CLOCK_TIME},            // 5. 表盘显示区域
  {L"时钟&日期",      {100,  0, 280,  45},  ID_CLOCK_TITLE},           // 6. 标题
  
  /************ 设置窗口控件 **************/
  /* 按钮 */
  {L"上一步",         {29,  221, 100,  40},  ID_CLOCK_BACK},            // 7. 上一步
  {L"下一步",         {350, 221, 100,  40},  ID_CLOCK_NEXT},            // 8. 下一步
  {L"F",              {  0,  8,  35,  35},  ID_CLOCK_WAIVE},           // 9. 放弃设置
  {L"完成",           {190, 221, 100,  40},  ID_CLOCK_OK},              // 10. 完成设置

  /* 文本 */
  {L"表盘选择",       {100,  0,  280,  45},  ID_CLOCK_SETTITLE},        // 11. 设置窗口标题
  {L"00:00",          {165,  52, 147,  25},  ID_CLOCK_SETTIME},         // 12. 设置窗口标题
  {L"2000年01月01日", {165,  52, 147,  25},  ID_CLOCK_SETDATE},         // 13. 设置窗口标题

  /* 单选按钮 */
  {L" ",              {0,    56, 154, 154},  ID_CLOCK_Background00},    // 14. 表盘 1
  {L" ",              {163,  56, 154, 154},  ID_CLOCK_Background01},    // 15. 表盘 2
  {L" ",              {317,  56, 154, 154},  ID_CLOCK_Background02},    // 16. 表盘 3

  /* 时钟&日历选择列表 */
  {L" ",              {139,  77,  100, 134},  ID_CLOCK_SetHour},         // 17. 设置小时的列表
  {L" ",              {239,  77,  101, 134},  ID_CLOCK_SetMinute},       // 18. 设置分钟的列表

  {L" ",              {139,  77,   67, 134},  ID_CLOCK_SetYear},         // 19. 设置年的列表
  {L" ",              {206,  77,   67, 134},  ID_CLOCK_SetMonth},        // 20. 设置月的列表
  {L" ",              {273,  77,   67, 134},  ID_CLOCK_SetDate},         // 21. 设置日的列表
 
};

/* 图片管理数组——HDC */
//const clock_hdc_t clock_png_info[hdc_clock_end] = 
//{
//  {GUI_CLOCK_BTN_PIC,       166, 70,     hdc_clock_btn},
//  {GUI_CLOCK_BTN_PRESS_PIC, 166, 70,     hdc_clock_btn_press},
//  {GUI_CLOCK_CALENDAR_PIC,  220, 240,    hdc_clock_calendar},
//  {GUI_CLOCK_00BACK_PIC,    233, 243,    hdc_clock_back_00},
//  {GUI_CLOCK_00H_PIC,         5, 45+39,  hdc_clock_h_00},
//  {GUI_CLOCK_00M_PIC,         5, 65+59,  hdc_clock_m_00},
//  {GUI_CLOCK_00S_PIC,         9, 103+53, hdc_clock_s_00},
//  {GUI_CLOCK_01BACK_PIC,    233, 243,    hdc_clock_back_01},
//  {GUI_CLOCK_01H_PIC,         6, 20+166, hdc_clock_h_01},
//  {GUI_CLOCK_01M_PIC,        16, 85+63,  hdc_clock_m_01},
//  {GUI_CLOCK_01S_PIC,         6, 102+72, hdc_clock_s_01},
//  {GUI_CLOCK_02BACK_PIC,    233, 243,    hdc_clock_back_02},
//  {GUI_CLOCK_02H_PIC,        15, 61+41,  hdc_clock_h_02},
//  {GUI_CLOCK_02M_PIC,        15, 77+57,  hdc_clock_m_02},
//  {GUI_CLOCK_02S_PIC,         7, 86+46,  hdc_clock_s_02},
//  {GUI_CLOCK_CHCKED_PIC,    272, 272,    hdc_clock_chcked},

//};

///* HDC */
//static HDC hdc_clock_bk;
//static HDC hdc_clock_png[hdc_clock_end];

/* 时钟位图 */
static BITMAP bm_clock_s_00;
static BITMAP bm_clock_m_00;
static BITMAP bm_clock_h_00;
static BITMAP bm_clock_s_01;
static BITMAP bm_clock_m_01;
static BITMAP bm_clock_h_01;
static BITMAP bm_clock_s_02;
static BITMAP bm_clock_m_02;
static BITMAP bm_clock_h_02;

static void exit_owner_draw(DRAWITEM_HDR *ds) //绘制一个按钮外观
{
  HDC hdc;
  RECT rc, rc_tmp;
  HWND hwnd;

	hdc = ds->hDC;   
	rc = ds->rc; 
  hwnd = ds->hwnd;

  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换

  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_bk, rc_tmp.x, rc_tmp.y, SRCCOPY);

  if (ds->State & BST_PUSHED)
	{ //按钮是按下状态
		SetPenColor(hdc, MapRGB(hdc, 120, 120, 120));      //设置文字色
	}
	else
	{ //按钮是弹起状态

		SetPenColor(hdc, MapRGB(hdc, 250, 250, 250));
	}
  
  rc.w = 25;
  OffsetRect(&rc, 0, 11);
  
  for(int i=0; i<4; i++)
  {
    HLine(hdc, rc.x, rc.y, rc.w);
    rc.y += 6;
  }
}

static void waive_btn_owner_draw(DRAWITEM_HDR *ds) //绘制一个按钮外观
{
	HDC hdc;
	RECT rc, rc_tmp;
  WCHAR wbuf[128];
  HWND hwnd;

	hdc = ds->hDC;   //button的绘图上下文句柄.
	rc = ds->rc;     //button的绘制矩形区.
  hwnd = ds->hwnd;

  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换

  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_bk, rc_tmp.x, rc_tmp.y, SRCCOPY);

  if (ds->State & BST_PUSHED)
  { //按钮是按下状态
    SetTextColor(hdc, MapRGB(hdc, 120, 120, 120));
  }
  else
  { //按钮是弹起状态
    SetTextColor(hdc, MapRGB(hdc, 255, 255, 255));
  }
  
  GetWindowText(ds->hwnd, wbuf, 128); //获得按钮控件的文字
  SetFont(hdc, controlFont_32);
  /* 显示文本 */
	DrawText(hdc, wbuf, -1, &rc, DT_VCENTER|DT_CENTER);//绘制文字(居中对齐方式)
}

static void btn_owner_draw(DRAWITEM_HDR *ds) //绘制一个按钮外观
{
	HDC hdc;
	RECT rc, rc_tmp;
  WCHAR wbuf[128];
  HWND hwnd;
  
  hwnd = ds->hwnd;
	hdc = ds->hDC;   //button的绘图上下文句柄.
	rc = ds->rc;     //button的绘制矩形区.

  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换

  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_bk, rc_tmp.x, rc_tmp.y, SRCCOPY);

  if (ds->State & BST_PUSHED)
  { //按钮是按下状态
    BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_png[hdc_clock_btn_press], 0, 0, SRCCOPY);
    SetTextColor(hdc, MapRGB(hdc, 200, 200, 200));
  }
  else
  { //按钮是弹起状态
    BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_png[hdc_clock_btn], 0, 0, SRCCOPY);
    SetTextColor(hdc, MapRGB(hdc, 255, 255, 255));
  }
  
