Embedfire-emxgui/emXGUI_demo_stm32f429/99-FreeRTOS+emXGUI综合桌面_4.3寸/User/app/Board_App/clock/GUI_CLOCK_DIALOG.c
  GetWindowText(ds->hwnd, wbuf, 128); //获得按钮控件的文字
  
  /* 显示文本 */
	DrawText(hdc, wbuf, -1, &rc, DT_VCENTER|DT_CENTER);//绘制文字(居中对齐方式)
}

static void radiobox_owner_draw(DRAWITEM_HDR *ds, int ID) // 单选按钮外观
{
	HDC hdc;
	RECT rc, rc_tmp;
  HWND hwnd;
  
  hwnd = ds->hwnd;
	hdc = ds->hDC;   //button的绘图上下文句柄.
	rc = ds->rc;     //button的绘制矩形区.

  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换

  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_bk, rc_tmp.x, rc_tmp.y, SRCCOPY);

  switch(ID)
  {
    case ID_CLOCK_Background00:
          BitBlt(hdc, rc.w/2.0-133/2.0, rc.h/2.0-139/2.0+4, 133, 139, hdc_clock_png[hdc_clock_back_00], 0, 0, SRCCOPY);
    break;

    case ID_CLOCK_Background01:
          BitBlt(hdc, rc.w/2.0-133/2.0, rc.h/2.0-139/2.0+4, 133, 139, hdc_clock_png[hdc_clock_back_01], 0, 0, SRCCOPY);
    break;

    case ID_CLOCK_Background02:
          BitBlt(hdc, rc.w/2.0-133/2.0, rc.h/2.0-139/2.0+4, 133, 139, hdc_clock_png[hdc_clock_back_02], 0, 0, SRCCOPY);
    break;
  }

  if (ds->State & BN_CHECKED)
  { 
    // 按钮被选中状态
    BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_png[hdc_clock_chcked], 0, 0, SRCCOPY);
  }
}

/*
 * @brief  重绘列表
 * @param  ds:	自定义绘制结构体
 * @retval NONE
*/
static void _draw_listbox(HDC hdc,HWND hwnd,COLOR_RGB32 text_c,COLOR_RGB32 back_c,COLOR_RGB32 sel_c, int fontsize)
{

	RECT rc,rc_cli;
	int i,count;
	WCHAR wbuf[128];


	GetClientRect(hwnd,&rc_cli);

	SetBrushColor(hdc,MapRGB888(hdc,back_c));
	FillRect(hdc,&rc_cli);

	SetTextColor(hdc,MapRGB888(hdc,text_c));

	i=SendMessage(hwnd,LB_GETTOPINDEX,0,0);
	count=SendMessage(hwnd,LB_GETCOUNT,0,0);

  if (fontsize == 24)
  {
    SetFont(hdc,controlFont_24);
  }
  else
  {
    SetFont(hdc,defaultFont);
  }
	

	while(i<count)
	{
		SendMessage(hwnd,LB_GETITEMRECT,i,(LPARAM)&rc);
		if(rc.y > rc_cli.h)
		{
			break;
		}

		SendMessage(hwnd,LB_GETTEXT,i,(LPARAM)wbuf);
		DrawText(hdc,wbuf,-1,&rc,DT_SINGLELINE|DT_CENTER|DT_VCENTER);

		i++;
	}



}

static void listbox_owner_draw(DRAWITEM_HDR *ds)
{
	HWND hwnd;
	HDC hdc,hdc0,hdc1;
	RECT rc_m;
	int x,y,w,h;

	hwnd =ds->hwnd;
	hdc =ds->hDC;

	//定义一个中间的矩形．
	rc_m.w =ds->rc.w;
	rc_m.h =27;
	rc_m.x =0;
	rc_m.y =(ds->rc.h-rc_m.h)>>1;

	//创建两个一样大小的DC,把listbox分别绘制进去，但颜色参数不同的.
	hdc0 =CreateMemoryDC(SURF_SCREEN,ds->rc.w,ds->rc.h);
	hdc1 =CreateMemoryDC(SURF_SCREEN,ds->rc.w,ds->rc.h);

	//一个listbox绘到hdc0中．
	_draw_listbox(hdc0,hwnd,RGB888(168,168,168),RGB888(250,250,250),RGB888(10,100,100),16);

	//一个listbox绘到hdc1中．
	_draw_listbox(hdc1,hwnd,RGB888(236,126,65),RGB888(232,232,232),RGB888(150,200,220), 24);

	//中间框绘制到hdc1中．
	SetPenColor(hdc1,MapRGB(hdc1,212,212,212));
	// DrawRect(hdc1,&rc_m);

  HLine(hdc1, rc_m.x, rc_m.y, rc_m.x + rc_m.w);
  HLine(hdc1, rc_m.x, rc_m.y+rc_m.h-1, rc_m.x + rc_m.w);

	//上面的矩形部分丛hdc0里复制出来.
	x =0;
	y =0;
	w =rc_m.w;
	h =rc_m.y-ds->rc.y;
	BitBlt(hdc,x,y,w,h,hdc0,x,y,SRCCOPY);

	//中间矩形部分丛hdc1里复制出来.
	BitBlt(hdc,rc_m.x,rc_m.y,rc_m.w,rc_m.h,hdc1,rc_m.x,rc_m.y,SRCCOPY);

	//下面的矩形部分丛hdc0里复制出来.
	x =0;
	y =rc_m.y+rc_m.h;
	w =rc_m.w;
	h =ds->rc.h-(rc_m.y+rc_m.h);
	BitBlt(hdc,x,y,w,h,hdc0,x,y,SRCCOPY);


	DeleteDC(hdc0);
	DeleteDC(hdc1);

}

uint8_t Sec = 0;
uint8_t Min = 0;
uint8_t Hour = 0;

static void Dial_OwnerDraw(DRAWITEM_HDR *ds)  // 绘制表盘
{
  HDC hdc;
	RECT rc, rc_tmp;
  RTC_TIME rtc_time;
  HWND hwnd;
  int clock_back;
  BITMAP clock_s, clock_m, clock_h;

	hdc = ds->hDC;   //button的绘图上下文句柄.
	rc = ds->rc;     //button的绘制矩形区.
  hwnd = ds->hwnd;

  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换

  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_bk, rc_tmp.x, rc_tmp.y, SRCCOPY);
  
  RTC_GetTime(RTC_Format_BIN, &rtc_time.RTC_Time);
//  RTC_GetDate(RTC_Format_BIN, &rtc_time.RTC_Date);
//  drv_clock.Time_flag=1;
//  drv_clock.Date_flag=1;
  Hour=rtc_time.RTC_Time.RTC_Hours;
  Min=rtc_time.RTC_Time.RTC_Minutes;
  Sec=rtc_time.RTC_Time.RTC_Seconds;
//  drv_clock.Date_day=rtc_time.RTC_Date.RTC_Date;
//  drv_clock.Date_month=rtc_time.RTC_Date.RTC_Month;
//  drv_clock.Date_year=rtc_time.RTC_Date.RTC_Year;
  /* Unfreeze the RTC DR Register */
  (void)RTC->DR;

  if (clock_dial == 0)    
  {
    clock_back = hdc_clock_back_00;
    clock_h = bm_clock_h_00;
    clock_m = bm_clock_m_00;
    clock_s = bm_clock_s_00;
  }
  else if (clock_dial == 1)
  {
    clock_back = hdc_clock_back_01;
    clock_h = bm_clock_h_01;
    clock_m = bm_clock_m_01;
    clock_s = bm_clock_s_01;
  }
  else if (clock_dial == 2)
  {
    clock_back = hdc_clock_back_02;
    clock_h = bm_clock_h_02;
    clock_m = bm_clock_m_02;
    clock_s = bm_clock_s_02;
  }

  BitBlt(hdc, 0, 0, 133, 139, hdc_clock_png[clock_back], 0, 0, SRCCOPY);
  EnableAntiAlias(hdc, TRUE);
  Hour = Hour>12 ? Hour-12 : Hour;
  RotateBitmap(hdc, 133/2, 139/2, &clock_h, Hour / 12.0 * 360 + 360.0 / 12.0 * Min / 60.0);
  RotateBitmap(hdc, 133/2, 139/2, &clock_m, Min / 60.0 * 360 + 360.0 / 60. * Sec / 60.0);
  RotateBitmap(hdc, 133/2, 139/2, &clock_s, Sec / 60.0 * 360);
  
  EnableAntiAlias(hdc, FALSE);
}

/*
 * @brief  重绘普通透明文本
 * @param  ds:	自定义绘制结构体
 * @retval NONE
*/
static void Common_Textbox_OwnerDraw(DRAWITEM_HDR *ds)
{
	HWND hwnd;
	HDC hdc;
  RECT rc,rc_tmp;
	WCHAR wbuf[128];
  HDC hdc_temp;

  hdc_temp = CreateMemoryDC((SURF_FORMAT)COLOR_FORMAT_ARGB8888, GUI_XSIZE, GUI_YSIZE);
  ClrDisplay(hdc_temp, NULL, 0);
  BitBlt(hdc_temp, 0, 0, GUI_XSIZE, GUI_YSIZE, hdc_clock_bk, 0, 0, SRCCOPY);
  BitBlt(hdc_temp, 303, 68, 132, 136, hdc_clock_png[hdc_clock_calendar], 0, 0, SRCCOPY);

	hwnd = ds->hwnd; //button的窗口句柄.
	hdc = ds->hDC;   //button的绘图上下文句柄.

	/* 背景 */
  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  GetClientRect(hwnd, &rc);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换

  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_temp, rc_tmp.x, rc_tmp.y, SRCCOPY);

	SetTextColor(hdc, MapRGB(hdc, 0, 0, 0));
	GetWindowText(hwnd, wbuf, 128); //获得按钮控件的文字
	DrawText(hdc, wbuf, -1, &rc, DT_VCENTER|DT_CENTER);//绘制文字(居中对齐方式)

  DeleteDC(hdc_temp);
}

/*
 * @brief  重绘标题透明文本
 * @param  ds:	自定义绘制结构体
 * @retval NONE
*/
static void Title_Textbox_OwnerDraw(DRAWITEM_HDR *ds)
{
	HWND hwnd;
	HDC hdc;
  RECT rc,rc_tmp;
	WCHAR wbuf[128];

  hwnd = ds->hwnd; //button的窗口句柄.
	hdc = ds->hDC;   //button的绘图上下文句柄.
  rc = ds->rc;

  /* 背景 */
  GetClientRect(hwnd, &rc_tmp);//得到控件的位置
  WindowToScreen(hwnd, (POINT *)&rc_tmp, 1);//坐标转换
  BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_bk, rc_tmp.x, rc_tmp.y, SRCCOPY);

	SetTextColor(hdc, MapRGB(hdc, 255, 255, 255));
	GetWindowText(hwnd, wbuf, 128);                        // 获得按钮控件的文字
	DrawText(hdc, wbuf, -1, &rc, DT_VCENTER|DT_CENTER);    // 绘制文字(居中对齐方式)
}

