Embedfire-emxgui/emXGUI_demo_stm32f429/99-FreeRTOS+emXGUI综合桌面_4.3寸/User/app/Board_App/clock/GUI_CLOCK_DIALOG.c
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetDate),  SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetYear),  SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetMonth), SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SETDATE),  SW_SHOW);
              }

              InvalidateRect(hwnd, &rc, TRUE);
            }
            break;

            /* 上一步 */
            case ID_CLOCK_BACK:
            {
              RECT rc = {139, 52, 201, 166};

              if (Set_Start.page == 2)
              {
                Set_Start.page = 1;    // 标记为时间设置界面
                SetWindowText(GetDlgItem(hwnd, ID_CLOCK_SETTITLE), L"设置时间");

                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetHour),   SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetMinute), SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_NEXT),      SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SETTIME),  SW_SHOW);

                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetDate),  SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetYear),  SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetMonth), SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SETDATE),  SW_HIDE);
              }
              else if (Set_Start.page == 1)
              {
                Set_Start.page = 0;    // 标记为表盘选择界面
                SetWindowText(GetDlgItem(hwnd, ID_CLOCK_SETTITLE), L"表盘选择");

                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_Background00), SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_Background01), SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_Background02), SW_SHOW);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetHour),      SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SetMinute),    SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_BACK),         SW_HIDE);
                ShowWindow(GetDlgItem(hwnd, ID_CLOCK_SETTIME),      SW_HIDE);
              }

              InvalidateRect(hwnd, &rc, TRUE);
            }
            break;
          }
        }

        /* 列表处理 */
        if (id >= ID_CLOCK_SetYear && id <= ID_CLOCK_SetMinute)
        {
          if(nr->code == LBN_SELCHANGE)    // 列表选中项被改变
          {
            
          }
          
          if(nr->code == LBN_POSCHANGE)    // 有列表位置被改变
          {
            RECT rc0,rc;
            HWND wnd;
            int i;

            wnd = GetDlgItem(hwnd, id);     // 获得被改变列表的 HWND

            GetClientRect(wnd,&rc0);
            /* 使列表循环 */
            i = 0;
            SendMessage(wnd,LB_GETITEMRECT,i,(LPARAM)&rc);
            if(rc.y > 2)
            {
              i =SendMessage(wnd,LB_GETCOUNT,0,0);
              i-=1;
              SendMessage(wnd,LB_MOVEINDEX,i,0);
            }
            else
            {
              i =SendMessage(wnd,LB_GETCOUNT,0,0);
              i-=1;
              SendMessage(wnd,LB_GETITEMRECT,i,(LPARAM)&rc);
              if((rc.y+rc.h) < (rc0.h-8))
              {
                SendMessage(wnd,LB_MOVEINDEX,0,0xFFFF);
              }
            }

            /* 设置靠近中间项为选中项 */
            int min = 0;    // 记录最近的（最后的选中项）
            int len = 0xFFFFFFF;
            int count = SendMessage(wnd,LB_GETCOUNT,0,0);
            i = SendMessage(wnd, LB_GETTOPINDEX, 0, 0);            // 首个显示的子项目
            
            while (1)
            {
              SendMessage(wnd, LB_GETITEMRECT, i, (LPARAM)&rc);    // 获得子项目的矩形参数

              if (rc.y >= rc0.h || i >= count - 1)          // 判断是不是在显示区域内
              {
                SendMessage(wnd, LB_SETCURSEL, min, 0);     // 设置当前选中的子项目
                break;                                      // 不是在显示区域，结束循环
              }

              rc.y += rc.h/2;                // 计算这项的中间位置
              rc.y = abs(rc.y - rc0.h/2);    // 计算当前项到中间的距离

              if (len > rc.y)
              {
                len = rc.y;    // 记录较小距离
                min = i;       // 记录较小项
              }
              i++;         // 查找下一项
              if (i>=count) 
              {
                i = 0;
              }
            }

            WCHAR wbuf[5];
            if (id >= ID_CLOCK_SetYear && id <= ID_CLOCK_SetDate)    // 这在设置日历
            {
              x_wsprintf(wbuf, L"%d年%02d月%02d日", GetListCurselVal(hwnd, ID_CLOCK_SetYear),
                                                    GetListCurselVal(hwnd, ID_CLOCK_SetMonth),
                                                    GetListCurselVal(hwnd, ID_CLOCK_SetDate));

              SetWindowText(GetDlgItem(hwnd, ID_CLOCK_SETDATE), wbuf);    // 设置日期
            }
            else    // 正在设置时间
            {
              x_wsprintf(wbuf, L"%02d:%02d", GetListCurselVal(hwnd, ID_CLOCK_SetHour),
                                             GetListCurselVal(hwnd, ID_CLOCK_SetMinute));

              SetWindowText(GetDlgItem(hwnd, ID_CLOCK_SETTIME), wbuf);    // 设置日期
            }
      
            uint8_t month = 0;
            month = GetListCurselVal(hwnd, ID_CLOCK_SetMonth);    // 获得选中的月
            if (id == ID_CLOCK_SetMonth || (id == ID_CLOCK_SetYear && month == 2))    // 设置月份，不同月份需调整日期
            {
              uint8_t date_max = 0;

              date_max = month_list[month - 1];

              if (month == 2)    // 调整平年 闰年
              {
                uint16_t year = GetListCurselVal(hwnd, ID_CLOCK_SetYear);    // 获得选中的年

                if( year % 400 == 0 || (year % 4 ==  0 && year % 100 != 0))
                {
                  date_max = 29;    // 闰年
                }
              }

              HWND ListHwnd = GetDlgItem(hwnd, ID_CLOCK_SetDate);

              SendMessage(ListHwnd, LB_RESETCONTENT, 0, 0);

              for (uint8_t xC=1; xC<date_max+1; xC++)
              {
                WCHAR wbuf[10];

                /* 在列表中增加日期 */
                x_wsprintf(wbuf, L"%d", xC);
                SendMessage(ListHwnd, LB_ADDSTRING, xC-1, (LPARAM)wbuf);
                SendMessage(ListHwnd, LB_SETITEMHEIGHT, xC-1, (LPARAM)27);
              }
              SendMessage(ListHwnd, LB_SETCURSEL, 2, 0);

              // uint8_t list_conut = SendMessage(ListHwnd, LB_GETCOUNT, 0, 0);
              // uint8_t DateCursel = GetListCurselVal(hwnd, ID_CLOCK_SetDate);    // 获得选中的日期
              // uint8_t max = 0;
              // uint8_t item = 0;

              // if (list_conut > date_max)
              // {
              //   /* 列表项目比实际要多需要删除 */
              //   for (uint8_t xC=0; xC<list_conut; xC++)
              //   {
              //     if (GetListItemVal(hwnd, ID_CLOCK_SetDate, xC) > date_max)
              //     {
              //       SendMessage(ListHwnd, LB_DELETESTRING, xC, 0);
              //     }
              //   }
              // }
              // else if (list_conut < date_max)
              // {
              //   /* 列表项目比实际要少需要增加 */
              //   for (uint8_t xC=0; xC<list_conut; xC++)    // 找到最大项目
              //   {
              //     if (GetListItemVal(hwnd, ID_CLOCK_SetDate, xC) > max)
              //     {
              //       item = xC;    // 记录较大项目
              //       max = GetListItemVal(hwnd, ID_CLOCK_SetDate, item);       // 得到最大项的内容
              //     }
              //   }

                
