Embedfire-emxgui/emXGUI_demo_stm32f429/99-FreeRTOS+emXGUI综合桌面_4.3寸/User/app/Board_App/clock/GUI_CLOCK_DIALOG.c
              //   list_conut = SendMessage(ListHwnd, LB_GETCOUNT, 0, 0);    // 得到现有的项目数
              //   uint8_t ii = max;    // 项目

              //   for (uint8_t xY=item; xY<list_conut+date_max-max+1; xY++)    // 在最大的项目后面增加需要增加的项目
              //   {
              //     x_wsprintf(wbuf, L"%d", ii+1);
              //     ii++;
              //     SendMessage(ListHwnd, LB_ADDSTRING, xY, (LPARAM)wbuf);      // 增加项目
              //     SendMessage(ListHwnd, LB_SETITEMHEIGHT, xY, (LPARAM)45);    // 设置项目高度
              //   }
              // }

              // /* 设置列表的选中项目 */
              // list_conut = SendMessage(ListHwnd, LB_GETCOUNT, 0, 0);
              // max = 0;
              // uint8_t xC=0;
              // for (xC=0; xC<list_conut; xC++)    // 找到最大项目
              // {
              //   if (GetListItemVal(hwnd, ID_CLOCK_SetDate, xC) == DateCursel)
              //   {
              //     SendMessage(ListHwnd, LB_SETCURSEL, xC, 0);    // 设置选中的项目
              //     break;
              //   }

              //   if (GetListItemVal(hwnd, ID_CLOCK_SetDate, xC) > max)
              //   {
              //     item = xC;    // 记录较大项目
              //     max = GetListItemVal(hwnd, ID_CLOCK_SetDate, xC);
              //   }
              // }

              // if (xC >= list_conut)    // 没找到原来的项，设置最大项为选中项
              // {
              //   SendMessage(ListHwnd, LB_SETCURSEL, item, 0);    // 设置选中的项目
              // }
              // printf("xC=%d,item=%d\n", xC, item);
            }
          }
        }

      break;
    }

      // 重绘制函数消息
      case WM_DRAWITEM:
      {
        DRAWITEM_HDR *ds;
        ds = (DRAWITEM_HDR*)lParam;        
        if (ds->ID >= ID_CLOCK_BACK && ds->ID <= ID_CLOCK_OK)
        {
          btn_owner_draw(ds);             // 重绘按钮
          return TRUE;
        }
        else if (ds->ID == ID_CLOCK_SETTITLE)
        {
          Title_Textbox_OwnerDraw(ds);
          return TRUE;
        }
        else if (ds->ID == ID_CLOCK_SETTIME || ds->ID == ID_CLOCK_SETDATE)
        {
          WhiteBK_Textbox_OwnerDraw(ds);
          return TRUE;
        }
        else if (ds->ID == ID_CLOCK_WAIVE)
        {
          waive_btn_owner_draw(ds);
          return TRUE;
        }
        else if (ds->ID >= ID_CLOCK_Background00 && ds->ID <= ID_CLOCK_Background02)
        {
          radiobox_owner_draw(ds, ds->ID);
          return TRUE;
        }
        else if (ds->ID >= ID_CLOCK_SetYear && ds->ID <= ID_CLOCK_SetMinute)
        {
          listbox_owner_draw(ds);
          return TRUE;
        }

        return FALSE;
      }     
      
      //绘制窗口界面消息
      case WM_PAINT:
      {
        PAINTSTRUCT ps;
//        HDC hdc;//屏幕hdc

        //开始绘制
        BeginPaint(hwnd, &ps); 
        
        EndPaint(hwnd, &ps);
      }
      break;

      case WM_ERASEBKGND:
      {
        HDC hdc =(HDC)wParam;
        RECT rc =*(RECT*)lParam;
        RECT rc1 = {139, 52, 201, 166};

        BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_bk, rc.x, rc.y, SRCCOPY);

        if (Set_Start.page != 0)     // 不是表盘选择
        {
          SetBrushColor(hdc, MapRGB(hdc, 250, 250, 250));
          EnableAntiAlias(hdc, TRUE);
          FillRoundRect(hdc, &rc1, 5);    // 画列表背景
          EnableAntiAlias(hdc, FALSE);
        }

        return TRUE;
      }

      //关闭窗口消息处理case
      case WM_CLOSE:
      {   
        DestroyWindow(hwnd);
        return TRUE;	
      }
    
      //关闭窗口消息处理case
      case WM_DESTROY:
      {
        SetTimer(clock_hwnd, 1, 400, TMR_START, NULL);

        return PostQuitMessage(hwnd);		
      }
      
      default:
         return DefWindowProc(hwnd, msg, wParam, lParam);
   }
     
   return WM_NULL;
}

static LRESULT win_proc(HWND hwnd, UINT msg, WPARAM wParam, LPARAM lParam)
{ 
  static uint8_t Load_Flag = 1;
   switch(msg){
      case WM_CREATE:
      {
        for (uint8_t xC=0; xC<ICON_BTN_NUM; xC++)     //  按钮
        {
          /* 循环创建按钮 */
          CreateWindow(BUTTON, clock_icon[xC].icon_name, WS_OWNERDRAW|WS_VISIBLE,
                        clock_icon[xC].rc.x, clock_icon[xC].rc.y,
                        clock_icon[xC].rc.w, clock_icon[xC].rc.h,
                        hwnd, clock_icon[xC].id, NULL, NULL); 
        }

        for (uint8_t xC=ICON_BTN_NUM; xC<ICON_TEXT_NUM; xC++)    // 文本框
        {
          /* 循环创建文本框 */
          CreateWindow(TEXTBOX, clock_icon[xC].icon_name, WS_OWNERDRAW|WS_VISIBLE,
                        clock_icon[xC].rc.x, clock_icon[xC].rc.y,
                        clock_icon[xC].rc.w,clock_icon[xC].rc.h,
                        hwnd, clock_icon[xC].id, NULL, NULL); 
        }

        /* 初始化日期 */
        WCHAR wbuf[5];
        RTC_TIME rtc_time;
        RTC_GetDate(RTC_Format_BIN, &rtc_time.RTC_Date);
        
        x_wsprintf(wbuf, L"%d", rtc_time.RTC_Date.RTC_Date);
        SetWindowText(GetDlgItem(hwnd, ID_CLOCK_DAY), wbuf);    // 设置日期
        
        x_wsprintf(wbuf, L"%d月", rtc_time.RTC_Date.RTC_Month);
        SetWindowText(GetDlgItem(hwnd, ID_CLOCK_MONTH), wbuf);    // 设置月
        
        SetWindowText(GetDlgItem(hwnd, ID_CLOCK_WEEK), Week_List[rtc_time.RTC_Date.RTC_WeekDay - 1]);    // 设置星期

        SetTimer(hwnd, 1, 400, TMR_START, NULL);
        
        /* 转换成bitmap */
        DCtoBitmap(hdc_clock_png[hdc_clock_s_00], &bm_clock_s_00);
        DCtoBitmap(hdc_clock_png[hdc_clock_h_00], &bm_clock_h_00);
        DCtoBitmap(hdc_clock_png[hdc_clock_m_00], &bm_clock_m_00);
        DCtoBitmap(hdc_clock_png[hdc_clock_s_01], &bm_clock_s_01);
        DCtoBitmap(hdc_clock_png[hdc_clock_h_01], &bm_clock_h_01);
        DCtoBitmap(hdc_clock_png[hdc_clock_m_01], &bm_clock_m_01);
        DCtoBitmap(hdc_clock_png[hdc_clock_s_02], &bm_clock_s_02);
        DCtoBitmap(hdc_clock_png[hdc_clock_h_02], &bm_clock_h_02);
        DCtoBitmap(hdc_clock_png[hdc_clock_m_02], &bm_clock_m_02);
        
        // SetTimer(hwnd, 2, 10, TMR_START|TMR_SINGLE, NULL);    // 资源加载定时器

        break;
      }

      case WM_TIMER:
      {
        int tmr_id;

				tmr_id = wParam;    // 定时器 ID

				if (tmr_id == 1)
        {
          WCHAR wbuf[5];
          
          RTC_TIME rtc_time;
          RTC_GetDate(RTC_Format_BIN, &rtc_time.RTC_Date);
          
