Embedfire-emxgui/emXGUI_demo_stm32f429/99-FreeRTOS+emXGUI综合桌面_4.3寸/User/app/Board_App/clock/GUI_CLOCK_DIALOG.c
          x_wsprintf(wbuf, L"%d", rtc_time.RTC_Date.RTC_Date);
          SetWindowText(GetDlgItem(hwnd, ID_CLOCK_DAY), wbuf);    // 设置日期
          
          x_wsprintf(wbuf, L"%d月", rtc_time.RTC_Date.RTC_Month);
          SetWindowText(GetDlgItem(hwnd, ID_CLOCK_MONTH), wbuf);    // 设置月
          
          SetWindowText(GetDlgItem(hwnd, ID_CLOCK_WEEK), Week_List[rtc_time.RTC_Date.RTC_WeekDay - 1]);    // 设置星期
          /* Unfreeze the RTC DR Register */
          (void)RTC->DR;
          
          InvalidateRect(GetDlgItem(hwnd, ID_CLOCK_TIME), NULL, TRUE);
        }
//        else if (tmr_id == 2)
//        {
//          u8 *jpeg_buf;
//          u32 jpeg_size;
//          JPG_DEC *dec;
//          BOOL res = NULL;

//          res = RES_Load_Content(GUI_CLOCK_BACKGROUNG_PIC, (char**)&jpeg_buf, &jpeg_size);
//          // res = FS_Load_Content(GUI_CLOCK_BACKGROUNG_PIC, (char**)&jpeg_buf, &jpeg_size);
//          hdc_clock_bk = CreateMemoryDC(SURF_SCREEN, GUI_XSIZE, GUI_YSIZE);
//          if(res)
//          {
//            /* 根据图片数据创建JPG_DEC句柄 */
//            dec = JPG_Open(jpeg_buf, jpeg_size);

//            /* 绘制至内存对象 */
//            JPG_Draw(hdc_clock_bk, 0, 0, dec);

//            /* 关闭JPG_DEC句柄 */
//            JPG_Close(dec);
//          }
//          /* 释放图片内容空间 */
//          RES_Release_Content((char **)&jpeg_buf);

//          u8 *pic_buf;
//          u32 pic_size;
//          PNG_DEC *png_dec;
//          BITMAP png_bm;
//          
//          for (uint8_t xC=0; xC<hdc_clock_end; xC++)
//          {
//            /* 创建 HDC */
//            hdc_clock_png[clock_png_info[xC].id] = CreateMemoryDC((SURF_FORMAT)COLOR_FORMAT_ARGB8888, clock_png_info[xC].w, clock_png_info[xC].h);
//            ClrDisplay(hdc_clock_png[clock_png_info[xC].id], NULL, 0);
//            res = RES_Load_Content(clock_png_info[xC].pic_name, (char**)&pic_buf, &pic_size);
//            // res = FS_Load_Content(clock_png_info[xC].pic_name, (char**)&pic_buf, &pic_size);
//            if(res)
//            {
//              png_dec = PNG_Open(pic_buf);
//              PNG_GetBitmap(png_dec, &png_bm);
//              DrawBitmap(hdc_clock_png[clock_png_info[xC].id], 0, 0, &png_bm, NULL);
//              PNG_Close(png_dec);
//            }
//            /* 释放图片内容空间 */
//            RES_Release_Content((char **)&pic_buf);
//          }

//          /* 转换成bitmap */
//          DCtoBitmap(hdc_clock_png[hdc_clock_s_00], &bm_clock_s_00);
//          DCtoBitmap(hdc_clock_png[hdc_clock_h_00], &bm_clock_h_00);
//          DCtoBitmap(hdc_clock_png[hdc_clock_m_00], &bm_clock_m_00);
//          DCtoBitmap(hdc_clock_png[hdc_clock_s_01], &bm_clock_s_01);
//          DCtoBitmap(hdc_clock_png[hdc_clock_h_01], &bm_clock_h_01);
//          DCtoBitmap(hdc_clock_png[hdc_clock_m_01], &bm_clock_m_01);
//          DCtoBitmap(hdc_clock_png[hdc_clock_s_02], &bm_clock_s_02);
//          DCtoBitmap(hdc_clock_png[hdc_clock_h_02], &bm_clock_h_02);
//          DCtoBitmap(hdc_clock_png[hdc_clock_m_02], &bm_clock_m_02);

//          Load_Flag = 1;    // 标志资源加载完成
//          for (uint32_t xC=0; xC<7; xC++)
//          {
//            ShowWindow(GetDlgItem(hwnd, clock_icon[xC].id), SW_SHOW);    // 资源加载完成，显示主页的全部控件
//          }
//          InvalidateRect(hwnd, NULL, TRUE);    // 重绘窗口
//        }
      }  
			break;     
      
      case WM_NOTIFY:
      {
         u16 code,  id;
         id  =LOWORD(wParam);//获取消息的ID码
         code=HIWORD(wParam);//获取消息的类型   

         //发送单击
        if(code == BN_CLICKED)
        {
          switch (id)
          {
            /* 退出按钮按下 */
            case ID_CLOCK_EXIT:
            {
              PostCloseMessage(hwnd);    // 发送关闭窗口的消息
            }
            break;

            /* 设置按钮按下 */
            case ID_CLOCK_SET:
            {
              KillTimer(hwnd, 1);
              /* 创建设置窗口 */
              WNDCLASS wcex;
              RECT rc;

              wcex.Tag	 		= WNDCLASS_TAG;

              wcex.Style			= CS_HREDRAW | CS_VREDRAW;
              wcex.lpfnWndProc	= (WNDPROC)setting_win_proc;
              wcex.cbClsExtra		= 0;
              wcex.cbWndExtra		= 0;
              wcex.hInstance		= NULL;
              wcex.hIcon			= NULL;
              wcex.hCursor		= NULL;
              
              rc.x = 0;
              rc.y = 0;
              rc.w = GUI_XSIZE;
              rc.h = GUI_YSIZE;
              
              // 创建"设置"窗口.
              CreateWindow(&wcex, L"---", WS_CLIPCHILDREN | WS_VISIBLE | WS_CLIPSIBLINGS,
                           rc.x, rc.y, rc.w, rc.h, hwnd, ID_CLOCK_SetWin, NULL, NULL);
            }
            break;
          }
        }
        break;
      }

      //重绘制函数消息
      case WM_DRAWITEM:
      {
         DRAWITEM_HDR *ds;
         ds = (DRAWITEM_HDR*)lParam;        
         if(ds->ID == ID_CLOCK_EXIT)
         {
            exit_owner_draw(ds);
            return TRUE;
         }
         else if (ds->ID == ID_CLOCK_SET)
         {
            btn_owner_draw(ds);
            return TRUE;
         }
         else if (ds->ID == ID_CLOCK_MONTH || ds->ID == ID_CLOCK_WEEK)
         {
           Common_Textbox_OwnerDraw(ds);
           return TRUE;
         }
         else if (ds->ID == ID_CLOCK_DAY)
         {
            Num_Textbox_OwnerDraw(ds);
            return TRUE;
         }
         else if (ds->ID == ID_CLOCK_TITLE)
         {
            Title_Textbox_OwnerDraw(ds);
            return TRUE;
         }
         else if (ds->ID == ID_CLOCK_TIME)
         {
            Dial_OwnerDraw(ds);
            return TRUE;
         }

         return FALSE;
      }     
      
      //绘制窗口界面消息
      case WM_PAINT:
      {
        PAINTSTRUCT ps;

        //开始绘制
        BeginPaint(hwnd, &ps); 
        
        EndPaint(hwnd, &ps);
        break;
      }
      
      case WM_ERASEBKGND:
      {
        HDC hdc =(HDC)wParam;
        RECT rc =*(RECT*)lParam;
        RECT rc2 = {0, 0, GUI_XSIZE, GUI_YSIZE};
        
        if (Load_Flag)     // 资源加载完成
        {
          BitBlt(hdc, rc.x, rc.y, rc.w, rc.h, hdc_clock_bk, rc.x, rc.y, SRCCOPY);
          BitBlt(hdc, 303, 68, 132, 136, hdc_clock_png[hdc_clock_calendar], 0, 0, SRCCOPY);
        }
        else
        {    /* 资源加载未完成 */ 
          SetBrushColor(hdc, MapRGB(hdc, 10, 10, 10));
          FillRect(hdc, &rc2);
          SetTextColor(hdc, MapRGB(hdc, 250, 250, 250));
          DrawText(hdc, L"资源加载中，请稍等...", -1, &rc2, DT_VCENTER|DT_CENTER);//绘制文字(居中对齐方式)
        }

        return TRUE;
      }

      //关闭窗口消息处理case
      case WM_CLOSE:
      {   
        DestroyWindow(hwnd);
        return TRUE;	
      }
    
      //关闭窗口消息处理case
      case WM_DESTROY:
      {        
//        Load_Flag = 0;
//        DeleteDC(hdc_clock_bk);
//        for (int i=0; i<hdc_clock_end; i++)
//        {
//          DeleteDC(hdc_clock_png[i]);
//        }
        return PostQuitMessage(hwnd);		
      }
      
      default:
         return DefWindowProc(hwnd, msg, wParam, lParam);
   }
     
   return WM_NULL;
}

void GUI_CLOCK_DIALOG(void)
{ 	
	WNDCLASS	wcex;
	MSG msg;

	wcex.Tag = WNDCLASS_TAG;

	wcex.Style = CS_HREDRAW | CS_VREDRAW;
	wcex.lpfnWndProc = win_proc; //设置主窗口消息处理的回调函数.
	wcex.cbClsExtra = 0;
	wcex.cbWndExtra = 0;
	wcex.hInstance = NULL;//hInst;
	wcex.hIcon = NULL;//LoadIcon(hInstance, (LPCTSTR)IDI_WIN32_APP_TEST);
	wcex.hCursor = NULL;//LoadCursor(NULL, IDC_ARROW);

	//创建主窗口
	clock_hwnd = CreateWindowEx(WS_EX_NOFOCUS|WS_EX_FRAMEBUFFER,//
                                    &wcex,
                                    L"GUI CLOCK DIALOG",
                                    WS_VISIBLE|WS_CLIPCHILDREN|WS_CLIPSIBLINGS,
                                    0, 0, GUI_XSIZE, GUI_YSIZE,
                                    NULL, NULL, NULL, NULL);

	//显示主窗口
	ShowWindow(clock_hwnd, SW_SHOW);

	//开始窗口消息循环(窗口关闭并销毁时,GetMessage将返回FALSE,退出本消息循环)。
	while (GetMessage(&msg, clock_hwnd))
	{
		TranslateMessage(&msg);
		DispatchMessage(&msg);
	}
}


